# Записать весь материал в LogSeq:
# Новые команды Git
# Все, что было записано про Python

# Прочитать PEP8

# 1. Написать скрипт, который принимает в консоль 2 параметра(переменные)
# Сичтает их
# Сумму (x + y)
# Разность (x - y)
# Умножение (x * y)
# Деление (x / y)
# Остаток от делеения (x % y)
# Целая часть от деления (x // y)
# и выводит в консоль в формате как на занятии "x {действие} y = {x действие y}"

# 2. Создать dict со своими параметрами name, surname, hobby, age и все, что придумаете
# Поля заполняете функцией input(Как тебя зовут? Сколько тебе лет, и т д)
# По итогу должен получиться dict, из которого вы генерируете строку с приветствием
# (Привет {name}, любящий {hobby[0]} и т д)
# Выводим строку в консоль

# Домашку положить в свою директорию `hubble_course/group/homework/{name}/'
# Первую часть задания в файл `hw_2025_01_22_part1.py`
# Вторую часть задания в файл `hw_2025_01_22_part2.py`

# Отправить все в одном PR(Pull Request в GitHub)
