# Написать конспект занятия в заметках
# Изучить PEP8 (переменные - как называть и тд)

# Пофиксить ошибки в коде ниже, чтобы он работал и был написан с учетом норм написания - правильно указаны типы данных

'''
my string = 'Строка"
num = 1234

my_string += ' для вывода в кносоль'

print("num = " + num)
print(my_string)

'''

# Функция input - функция принимает ввод чего-то в консоль
# То есть ожидает, что пользователь введет что-то в терминал
# Пример:
    # user_text = input('Напиши, что-то в консоль')
    # print(f'Вы написали: {user_text}')
# Задача:
    # Написать код, который получает 2 числа от потльзователя(с помощью input)
    # Выводит в консоль строку вида 'Остаток от деления z на y равен z'
    # Где x - первое вводимое число, y - второе, а z - остаток от деления x на y

