# Записать все, что мы прошли на первом занятии в заметки
# Написать программу, которая принимает 2 числа(через input) и выводит их сумму
# Найти как называть переменные

a = int(input("Введи первое число для сложения: "))
b = int(input("Введи второе число для сложения: "))
print(f"{a} + {b} = {a+b}")