# Записать все, что мы прошли на первом занятии в заметки
# Написать программу, которая принимает 2 числа(через input) и выводит их сумму
# Найти как называть переменные

text = 'Unbelievable'
dict = {}
for letter in text:
	dict[letter] = text.count(letter)
print(dict)